package edu.xcu.designPattern;

public class DesignPattern {
    /**
     * 设计模式学习：
     * 1、参考文章地址：https://javadoop.com/post/design-pattern
     * 2、设计模式分类：
     *      2.1 创建型
     *          2.1.1 简单工厂模式
     *          2.1.2 工厂模式
     *          2.1.3 抽象工厂模式
     *          2.1.4 单例模式 ：
     *              1 饿汉模式
     *              2 饱汉模式
     *              3 嵌套类
     *          2.1.5 建造者模式
     *          2.1.6 原型模式
     *
     *      2.2 结构型
     *          2.2.1 代理模式 ：
     *          2.2.2 适配器模式
     *          2.2.3 桥梁模式
     *          2.2.4 装饰模式
     *          2.2.5 门面模式
     *          2.2.6 组合模式
     *          2.2.7 亨元模式
     *
     *      2.3 行为型
     *          2.3.1 策略模式 ： 常用
     *          2.3.2 观察者模式
     *          2.3.3 责任链模式
     *          2.3.4 模板方法模式
     *          2.3.5 状态模式
     *          2.3.6
     * 3、需掌握：三种工厂模式、单例模式、建造者模式、代理模式、适配器模式。
     */
    public static void main(String[] args) {
        System.out.println(
                "    /**\n" +
                        "     * 设计模式学习：\n" +
                        "     * 1、参考文章地址：https://javadoop.com/post/design-pattern\n" +
                        "     * 2、设计模式分类：\n" +
                        "     *      2.1 创建型\n" +
                        "     *          2.1.1 简单工厂模式\n" +
                        "     *          2.1.2 工厂模式\n" +
                        "     *          2.1.3 抽象工厂模式\n" +
                        "     *          2.1.4 单例模式 ：\n" +
                        "     *              1 饿汉模式\n" +
                        "     *              2 饱汉模式\n" +
                        "     *              3 嵌套类\n" +
                        "     *          2.1.5 建造者模式\n" +
                        "     *          2.1.6 原型模式\n" +
                        "     *\n" +
                        "     *      2.2 结构型\n" +
                        "     *          2.2.1 代理模式 ：\n" +
                        "     *          2.2.2 适配器模式\n" +
                        "     *          2.2.3 桥梁模式\n" +
                        "     *          2.2.4 装饰模式\n" +
                        "     *          2.2.5 门面模式\n" +
                        "     *          2.2.6 组合模式\n" +
                        "     *          2.2.7 亨元模式\n" +
                        "     *\n" +
                        "     *      2.3 行为型\n" +
                        "     *          2.3.1 策略模式 ： 常用\n" +
                        "     *          2.3.2 观察者模式\n" +
                        "     *          2.3.3 责任链模式\n" +
                        "     *          2.3.4 模板方法模式\n" +
                        "     *          2.3.5 状态模式\n" +
                        "     *          2.3.6 \n" +
                        "     */"
        );
    }
}
